app/controllers/comments_controller.rb

	def create
		@comment = @post.comments.create(comment_params)
		@comment.user_id = current_user.id
		if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sadfsaf"], ["post_id", 3], ["created_at", "2015-12-27 00:05:24.160468"], ["updated_at", "2015-12-27 00:05:24.160468"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 2], ["updated_at", "2015-12-29 17:44:30.411456"], ["id", 20]]

	def update
		@comment.update_attributes(comment_params)
---
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "New comment - NEW"], ["updated_at", "2015-12-27 00:59:23.925079"], ["id", 3]]

	def find_comment
		@comment = @post.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 3], ["id", 3]]