app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "A memory with a user 100%"], ["description", "Will see! :)"], ["user_id", 1], ["created_at", "2015-12-29 16:41:17.922958"], ["updated_at", "2015-12-29 16:41:17.922958"]]

	def update
		#@post.avatar = nil if @postDelete == "1"
		if @post.update(post_params)
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Will see! :) UPDATE!"], ["updated_at", "2015-12-29 16:44:43.568646"], ["id", 6]]