app/controllers/settings_controller.rb

	def index
		@users = User.order('lastname ASC').all
---
SELECT "users".* FROM "users"  ORDER BY lastname DESC

	def destroy
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  	def change_user_authority
  		@user = User.find(params[:id])
  		if @user.admin == true
  			@user.admin = false
  		else
  			@user.admin = true
  		end
  		@user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", "t"], ["updated_at", "2016-08-13 14:25:28.102934"], ["id", 13]]